/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strrchr.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jnam <jnam@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/03 15:12:09 by jnam              #+#    #+#             */
/*   Updated: 2022/01/06 16:26:33 by jnam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
//문자열에서 특정 문자를 찾을 때 사용하는 함수
//문자열 s에서 마지막으로 찾은 문자 c의 포인터를 리턴
//return (문자열 포인터 변수)
char *strrchr(const char *s, int c)
{
    char *find;

    *find = NULL;
    while (*s != '\0')
    {
        if(*s == c)
            find = (char *)s;
        s++;
    }
    return (find);
}